package com.company;

/**
 * 2 Создание комплексного класса.
 *
 * 2.1 Создать класс Pizza. Описать поля:
 * basis – поле типа Circle
 * composition – состав пиццы
 * name – название пиццы
 * cost – цена.
 *
 * 2.2 Создать конструктор, который принимает в качестве параметров имя, состав, цену и диаметр пиццы.
 * Внутри конструктора создать объект класса Circle применив диаметр.
 *
 * 2.3 Создать класс Pizzeria c методом main в котором создать массив из разных пицц.
 *
 * 2.4 Вывести в цикле информацию о каждой пицце.
 *
 * 2.5  Написать JavaDoc для всех классов.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
